Tekla.Structures.Catalogs.ComponentItemEnumerator
The ComponentItemEnumerator class allows to loop through the component catalog items.
The following example returns true if an item with the name EndPlate and with the number 144 has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
ComponentItemEnumerator ComponentItemEnumerator = CatalogHandler.GetComponentItems();
while (ComponentItemEnumerator.MoveNext())
{
ComponentItem ComponentItem = ComponentItemEnumerator.Current as ComponentItem;
if (ComponentItem.Name == "EndPlate" && ComponentItem.Number == 144)
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.ComponentItemEnumerator.#ctor
The constructor takes as parameter the filter for which items from the catalog
will enumerate.

Tekla.Structures.Catalogs.ComponentItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type ComponentItem.

Tekla.Structures.Catalogs.ComponentItemEnumerator.Current
Returns a component item instance of the current element.

Tekla.Structures.Catalogs.ComponentItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.ComponentItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.ComponentItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Catalogs.ComponentItemEnumerator.GetComponentIndex``1(``0,System.Int32,System.Collections.ArrayList,System.Collections.IList)
Get component index given key and type.
The key type.
Key: The component key value.
Type: The component type.
KeyList: An ArrayList of keys to search to determine the index.
TypesList: An ArrayList of types associated with the keys.
Returns: The index of the key in KeyList that matches the associated type in TypesList, or -1 if no match is found.